from syllable_converter import convert_to_ipa, split_ipa_into_units, convert_ipa_to_syllables
import re

vai_syllabary = {
    "":     {"e": "ꔀ", "i": "ꔤ", "a": "ꕉ", "o": "ꕱ", "u": "ꖕ", "ɔ": "ꖺ", "ɛ": "ꗡ"},
    "̃":    {"e": "ꔁ", "i": "ꔥ", "a": "ꕊ", "o": "ꕲ", "u": "ꖖ", "ɔ": "ꖻ", "ɛ": "ꗢ"},
    "ŋ̃":   {"a": "ꕋ", "ɔ": "ꖼ", "ɛ": "ꗣ"},
    "h":    {"e": "ꔂ", "i": "ꔦ", "a": "ꕌ", "o": "ꕳ", "u": "ꖗ", "ɔ": "ꖽ", "ɛ": "ꗤ"},
    "h̃":   {"i": "ꔧ", "a": "ꕍ", "u": "ꖘ", "ɔ": "ꖾ", "ɛ": "ꗥ"},
    "w":    {"e": "ꔃ", "i": "ꔨ", "a": "ꕎ", "o": "ꕴ", "u": "ꖙ", "ɔ": "ꖿ", "ɛ": "ꗦ"},
    "w̃":   {"e": "ꔄ", "i": "ꔩ", "a": "ꕏ", "o": "ꕵ", "u": "ꖚ", "ɔ": "ꗀ", "ɛ": "ꗧ"},
    "p":    {"e": "ꔅ", "i": "ꔪ", "a": "ꕐ", "o": "ꕶ", "u": "ꖛ", "ɔ": "ꗁ", "ɛ": "ꗨ"},
    "b":    {"e": "ꔆ", "i": "ꔫ", "a": "ꕑ", "o": "ꕷ", "u": "ꖜ", "ɔ": "ꗂ", "ɛ": "ꗩ"},
    "ɓ":    {"e": "ꔇ", "i": "ꔬ", "a": "ꕒ", "o": "ꕸ", "u": "ꖝ", "ɔ": "ꗃ", "ɛ": "ꗪ"},
    "mɓ":   {"e": "ꔈ", "i": "ꔭ", "a": "ꕓ", "o": "ꕹ", "u": "ꖞ", "ɔ": "ꗄ", "ɛ": "ꗫ"},
    "kp":   {"e": "ꔉ", "i": "ꔮ", "a": "ꕔ", "o": "ꕺ", "u": "ꖟ", "ɔ": "ꗅ", "ɛ": "ꗬ"},
    "kp̃":  {"a": "ꕕ", "ɛ": "ꗭ"},
    "mgb":  {"e": "ꔊ", "i": "ꔯ", "a": "ꕖ", "o": "ꕻ", "u": "ꖠ", "ɔ": "ꗆ", "ɛ": "ꗮ"},
    "gb":   {"e": "ꔋ", "i": "ꔰ", "a": "ꕗ", "o": "ꕼ", "u": "ꖡ", "ɔ": "ꗇ", "ɛ": "ꗯ"},
    "gb̃":  {"ɛ": "ꗰ"},
    "f":    {"e": "ꔌ", "i": "ꔱ", "a": "ꕘ", "o": "ꕽ", "u": "ꖢ", "ɔ": "ꗉ", "ɛ": "ꗱ"},
    "v":    {"e": "ꔍ", "i": "ꔲ", "a": "ꕙ", "o": "ꕾ", "u": "ꖣ", "ɔ": "ꗊ", "ɛ": "ꗲ"},
    "t":    {"e": "ꔎ", "i": "ꔳ", "a": "ꕚ", "o": "ꕿ", "u": "ꖤ", "ɔ": "ꗋ", "ɛ": "ꗳ"},
    "θ":    {"e": "ꔏ", "i": "ꔴ", "a": "ꕛ", "o": "ꖀ", "u": "ꖥ", "ɔ": "ꗌ", "ɛ": "ꗴ"},
    "d":    {"e": "ꔐ", "i": "ꔵ", "a": "ꕜ", "o": "ꖁ", "u": "ꖦ", "ɔ": "ꗍ", "ɛ": "ꗵ"},
    "ð":    {"e": "ꔑ", "i": "ꔶ", "a": "ꕝ", "o": "ꖂ", "u": "ꖧ", "ɔ": "ꗎ", "ɛ": "ꗶ"},
    "l":    {"e": "ꔒ", "i": "ꔷ", "a": "ꕞ", "o": "ꖃ", "u": "ꖨ", "ɔ": "ꗏ", "ɛ": "ꗷ"},
    "r":    {"e": "ꔓ", "i": "ꔸ", "a": "ꕟ", "o": "ꖄ", "u": "ꖩ", "ɔ": "ꗐ", "ɛ": "ꗸ"},
    "ɗ":    {"e": "ꔔ", "i": "ꔹ", "a": "ꕠ", "o": "ꖅ", "u": "ꖪ", "ɔ": "ꗑ", "ɛ": "ꗹ"},
    "nɗ":   {"e": "ꔕ", "i": "ꔺ", "a": "ꕡ", "o": "ꖆ", "u": "ꖫ", "ɔ": "ꗒ", "ɛ": "ꗺ"},
    "s":    {"e": "ꔖ", "i": "ꔻ", "a": "ꕢ", "o": "ꖇ", "u": "ꖬ", "ɔ": "ꗓ", "ɛ": "ꗻ"},
    "ʃ":    {"e": "ꔗ", "i": "ꔼ", "a": "ꕣ", "o": "ꖈ", "u": "ꖭ", "ɔ": "ꗔ", "ɛ": "ꗼ"},
    "z":    {"e": "ꔘ", "i": "ꔽ", "a": "ꕤ", "o": "ꖉ", "u": "ꖮ", "ɔ": "ꗕ", "ɛ": "ꗽ"},
    "ʒ":    {"e": "ꔙ", "i": "ꔾ", "a": "ꕥ", "o": "ꖊ", "u": "ꖯ", "ɔ": "ꗖ", "ɛ": "ꗾ"},
    "tʃ":   {"e": "ꔚ", "i": "ꔿ", "a": "ꕦ", "o": "ꖋ", "u": "ꖰ", "ɔ": "ꗗ", "ɛ": "ꗿ"},
    "dʒ":   {"e": "ꔛ", "i": "ꕀ", "a": "ꕧ", "o": "ꖌ", "u": "ꖱ", "ɔ": "ꗘ", "ɛ": "ꘀ"},
    "ndʒ":  {"e": "ꔜ", "i": "ꕁ", "a": "ꕨ", "o": "ꖍ", "u": "ꖲ", "ɔ": "ꗙ", "ɛ": "ꘁ"},
    "j":    {"e": "ꔝ", "i": "ꕂ", "a": "ꕩ", "o": "ꖎ", "u": "ꖳ", "ɔ": "ꗚ", "ɛ": "ꘂ"},
    "k":    {"e": "ꔞ", "i": "ꕃ", "a": "ꕪ", "o": "ꖏ", "u": "ꖴ", "ɔ": "ꗛ", "ɛ": "ꘃ"},
    "k̃":   {"a": "ꕫ"},
    "ŋg":   {"e": "ꔟ", "i": "ꕄ", "a": "ꕬ", "o": "ꖐ", "u": "ꖵ", "ɔ": "ꗜ", "ɛ": "ꘄ"},
    "ŋg̃":  {"ɛ": "ꘅ"},
    "g":    {"e": "ꔠ", "i": "ꕅ", "a": "ꕭ", "o": "ꖑ", "u": "ꖶ", "ɔ": "ꗝ", "ɛ": "ꘆ"},
    "g̃":   {"ɛ": "ꘇ"},
    "m":    {"e": "ꔡ", "i": "ꕆ", "a": "ꕮ", "o": "ꖒ", "u": "ꖷ", "ɔ": "ꗞ", "ɛ": "ꘈ"},
    "n":    {"e": "ꔢ", "i": "ꕇ", "a": "ꕯ", "o": "ꖓ", "u": "ꖸ", "ɔ": "ꗟ", "ɛ": "ꘉ"},
    "ɲ":    {"e": "ꔣ", "i": "ꕈ", "a": "ꕰ", "o": "ꖔ", "u": "ꖹ", "ɔ": "ꗠ", "ɛ": "ꘊ"}
}

# all consonants not in vai, but in IPA
# are mapped to the closest vai consonant
closest_consonant_mapping = {
    "θ": "t",
    "ð": "d",
    "ʃ": "s",
    "ʒ": "z",
    "tʃ": "t",
    "dʒ": "d",
    "w": "h",
    "ɫ": "l",
    "ŋ": "n",
    "ɹ": "r",
    "j": "y",
    "h": "h",
    "l": "l",
}


def convert_to_vai(text):
    pass

if __name__ == "__main__":
    text = "Hello, how are you?"
    vai_text = convert_to_vai(text)
    print(f"Original text: {text}")
    print(f"Vai text: {vai_text}")